# IFCParameter Template Export Revit Material Parameters Property

Source: https://www.revitapidocs.com/2026/3ec391e5-4311-f7da-0d02-dae0fb6e8d0b.htm

---

| IFCParameter Template Export Revit Material Parameters Property |
| --- |

The option to export Revit material parameters to IFC.
 If true, then all Revit material parameters not excluded will be exported.
 If false, then no Revit material parameters will be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool ExportRevitMaterialParameters { get; set; }
```

```
Public Property ExportRevitMaterialParameters As Boolean
	Get
	Set
```

```
public:
property bool ExportRevitMaterialParameters {
	bool get ();
	void set (bool value);
}
```

```
member ExportRevitMaterialParameters : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace